spacemandev-git/solana-htn/firmware/sdkconfig.defaults
# HTN OS defaults. Target and flash geometry match the badge's HAL guide:
# ESP32-C3-MINI-1-N4, 4 MB, DIO, 80 MHz, console on USB-Serial-JTAG.
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# Console: native USB-Serial-JTAG, not UART0.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# Wi-Fi + TLS to the badge service (wss://). Full bundle so Google Trust
# Services roots (the load balancer's managed cert) are present.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=16
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=16384
CONFIG_LWIP_TCP_WND_DEFAULT=16384
CONFIG_ESP_WIFI_NVS_ENABLED=y

# Bluetooth stays off: the HAL guide warns NimBLE's stock buffers OOM this board.
CONFIG_BT_ENABLED=n

# FreeRTOS tick 1 kHz so the 10 ms button poll is exact.
CONFIG_FREERTOS_HZ=1000

# Keep the app under the 0x2A0000 factory partition.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
